{
  "message": "recommendations retrieved successfully",
  "recommendations": {
    "based_on": "Developer Favorites",
    "recommendations": [
      {
        "authors": [
          "Milan Kundera"
        ],
        "averageRating": 3.5,
        "categories": [
          "Fiction"
        ],
        "description": "When The Unbearable Lightness of Being was first published in English, it was hailed as \"a work of the boldest mastery, originality, and richness\" by critic Elizabeth Hardwick and named one of the best books of 1984 by the New York Times Book Review. It went on to win the Los Angeles Times Book Prize for Fiction and quickly became an international bestseller. Twenty years later, the novel has established itself as a modern classic. To commemorate the anniversary of its first English-language publication, HarperCollins is proud to offer a special hardcover edition. A young woman in love with a man torn between his love for her and his incorrigible womanizing; one of his mistresses and her humbly faithful lover -- these are the two couples whose story is told in this masterful novel. Controlled by day, Tereza's jealousy awakens by night, transformed into ineffably sad death-dreams, while Tomas, a successful surgeon, alternates loving devotion to the dependent Tereza with the ardent pursuit of other women. Sabina, an independent, free-spirited artist, lives her life as a series of betrayals -- of parents, husband, country, love itself -- whereas her lover, the intellectual Franz, loses all because of his earnest goodness and fidelity. In a world in which lives are shaped by irrevocable choices and by fortuitous events, a world in which everything occurs but once, existence seems to lose its substance, its weight. Hence we feel, says the novelist, \"the unbearable lightness of being\" -- not only as the consequence of our private acts but also in the public sphere, and the two inevitably intertwine. This magnificent novel encompasses the extremes of comedy and tragedy, and embraces, it seems, all aspects of human existence. It juxtaposes geographically distant places (Prague, Geneva, Paris, Thailand, the United States, a forlorn Bohemian village); brilliant and playful reflections (on \"eternal return,\" on kitsch, on man and animals -- Tomas and Tereza have a beloved doe named Karenin); and a variety of styles (from the farcical to the elegiac) to take its place as perhaps the major achievement of one of the world's truly great writers.",
        "googleId": "7QpErH6s8hcC",
        "isEbook": false,
        "isbn10": "0060597186",
        "isbn13": "9780060597184",
        "language": "en",
        "pageCount": 320,
        "publishedDate": "2004-05-04",
        "publisher": "Harper Collins",
        "smallThumbnail": "http://books.google.com/books/content?id=7QpErH6s8hcC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "When The Unbearable Lightness of Being was first published in English, it was hailed as &quot;a work of the boldest mastery, originality, and richness&quot; by critic Elizabeth Hardwick and named one of the best books of 1984 by the New York Times ...",
        "thumbnail": "http://books.google.com/books/content?id=7QpErH6s8hcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "The Unbearable Lightness of Being",
        "webReaderLink": "http://play.google.com/books/reader?id=7QpErH6s8hcC&hl=&printsec=frontcover&source=gbs_api"
      },
      {
        "authors": [
          "Franz Kafka"
        ],
        "averageRating": 5,
        "categories": [
          "Fiction"
        ],
        "description": "“This fine version, with David Cronenberg’s inspired introduction and the new translator’s beguiling afterword, is, I suspect, the most disturbing though the most comforting of all so far; others will follow, but don’t hesitate: this is the transforming text for you.”—Richard Howard Franz Kafka’s 1915 novella of unexplained horror and nightmarish transformation became a worldwide classic and remains a century later one of the most widely read works of fiction in the world. It is the story of traveling salesman Gregor Samsa, who wakes one morning to find himself transformed into a monstrous insect. This hugely influential work inspired George Orwell, Albert Camus, Jorge Louis Borges, and Ray Bradbury, while continuing to unsettle millions of readers. In her new translation of Kafka’s masterpiece, Susan Bernofsky strives to capture both the humor and the humanity in this macabre tale, underscoring the ways in which Gregor Samsa’s grotesque metamorphosis is just the physical manifestation of his longstanding spiritual impoverishment.",
        "googleId": "ZRYfAgAAQBAJ",
        "isEbook": true,
        "isbn10": "0393347656",
        "isbn13": "9780393347654",
        "language": "en",
        "pageCount": 160,
        "publishedDate": "2014-01-20",
        "publisher": "W. W. Norton & Company",
        "smallThumbnail": "http://books.google.com/books/content?id=ZRYfAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "“This fine version, with David Cronenberg’s inspired introduction and the new translator’s beguiling afterword, is, I suspect, the most disturbing though the most comforting of all so far; others will follow, but don’t hesitate: ...",
        "thumbnail": "http://books.google.com/books/content?id=ZRYfAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "The Metamorphosis: A New Translation by Susan Bernofsky",
        "webReaderLink": "http://play.google.com/books/reader?id=ZRYfAgAAQBAJ&hl=&printsec=frontcover&source=gbs_api"
      },
      {
        "authors": [
          "Chuck Palahniuk"
        ],
        "averageRating": 4,
        "categories": [
          "Fiction"
        ],
        "description": "The first rule about fight club is you don't talk about fight club. Chuck Palahniuk showed himself to be his generation’s most visionary satirist in this, his first book. Fight Club’s estranged narrator leaves his lackluster job when he comes under the thrall of Tyler Durden, an enigmatic young man who holds secret after-hours boxing matches in the basements of bars. There, two men fight \"as long as they have to.\" This is a gloriously original work that exposes the darkness at the core of our modern world.",
        "googleId": "hoGkPfds4tAC",
        "isEbook": true,
        "isbn10": "0393066398",
        "isbn13": "9780393066395",
        "language": "en",
        "pageCount": 224,
        "publishedDate": "2005-10-17",
        "publisher": "W. W. Norton & Company",
        "smallThumbnail": "http://books.google.com/books/content?id=hoGkPfds4tAC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "There, two men fight &quot;as long as they have to.&quot; This is a gloriously original work that exposes the darkness at the core of our modern world.",
        "thumbnail": "http://books.google.com/books/content?id=hoGkPfds4tAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "Fight Club: A Novel",
        "webReaderLink": "http://play.google.com/books/reader?id=hoGkPfds4tAC&hl=&printsec=frontcover&source=gbs_api"
      },
      {
        "authors": [
          "Ray Bradbury"
        ],
        "averageRating": 3.5,
        "categories": [
          "Fiction"
        ],
        "description": "NOW AN HBO FILM STARRING MICHAEL B. JORDAN AND MICHAEL SHANNON Sixty years after its originally publication, Ray Bradbury’s internationally acclaimed novel Fahrenheit 451 stands as a classic of world literature set in a bleak, dystopian future. Today its message has grown more relevant than ever before. Guy Montag is a fireman. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden. Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television “family.” But when he meets an eccentric young neighbor, Clarisse, who introduces him to a past where people didn’t live in fear and to a present where one sees the world through the ideas in books instead of the mindless chatter of television, Montag begins to question everything he has ever known.",
        "googleId": "OYtkbGl2j0sC",
        "isEbook": true,
        "isbn10": "143914267X",
        "isbn13": "9781439142677",
        "language": "en",
        "pageCount": 208,
        "publishedDate": "2011-11-29",
        "publisher": "Simon and Schuster",
        "smallThumbnail": "http://books.google.com/books/content?id=OYtkbGl2j0sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "Montag never questions the destruction and ruin his actions produce, returning each day to his bland life and wife, Mildred, who spends all day with her television “family.” But when he meets an eccentric young neighbor, Clarisse, who ...",
        "thumbnail": "http://books.google.com/books/content?id=OYtkbGl2j0sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "Fahrenheit 451",
        "webReaderLink": "http://play.google.com/books/reader?id=OYtkbGl2j0sC&hl=&printsec=frontcover&source=gbs_api"
      },
      {
        "authors": [
          "John Boyne"
        ],
        "averageRating": 4,
        "categories": [
          "Young Adult Fiction"
        ],
        "description": "“Powerful and unsettling. . . . As memorable an introduction to the subject as The Diary of Anne Frank.” —USA Today Berlin, 1942: When Bruno returns home from school one day, he discovers that his belongings are being packed in crates. His father has received a promotion and the family must move to a new house far, far away, where there is no one to play with and nothing to do. A tall fence stretches as far as the eye can see and cuts him off from the strange people in the distance. But Bruno longs to be an explorer and decides that there must be more to this desolate new place than meets the eye. While exploring his new environment, he meets another boy whose life and circumstances are very different from his own, and their meeting results in a friendship that has devastating consequences. From the Hardcover edition.",
        "googleId": "p-2s2PWArTQC",
        "isEbook": true,
        "isbn10": "0307494233",
        "isbn13": "9780307494238",
        "language": "en",
        "pageCount": 240,
        "publishedDate": "2008-12-18",
        "publisher": "David Fickling Books",
        "smallThumbnail": "http://books.google.com/books/content?id=p-2s2PWArTQC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
        "textSnippet": "“Powerful and unsettling.",
        "thumbnail": "http://books.google.com/books/content?id=p-2s2PWArTQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
        "title": "The Boy in the Striped Pajamas",
        "webReaderLink": "http://play.google.com/books/reader?id=p-2s2PWArTQC&hl=&printsec=frontcover&source=gbs_api"
      }
    ]
  }
}
